export class AppConstants{

     static prayerMap:any={"Fajr": {  "name":"الفجر","width":"38","height":"38","class":"ms-1","timeFormat":"ص"},"Sunrise": {"name":"الشروق","width":"50","height":"50","timeFormat":"ص"},"Dhuhr":{"name":"الظهر","width":"40","height":"40","class":"ms-1","timeFormat":"ص"},"Asr":{"name":"العصر","width":"45","height":"45","timeFormat":"ص"},"Maghrib":{"name":"المغرب","width":"50","height":"40","timeFormat":"م"},"Isha":{"name":"العشاء","width":"35","height":"35","class":"ms-1","timeFormat":"م"}}

     static monthArabic:any= {
        "January": "يناير",
        "February": "فبراير",
        "March": "مارس",
        "April": "أبريل",
        "May": "مايو",
        "June": "يونيو",
        "July": "يوليو",
        "August": "أغسطس",
        "September": "سبتمبر",
        "October": "أكتوبر",
        "November": "نوفمبر",
        "December": "ديسمبر"
      }
      static months = [
        "يناير",
        "فبراير",
        "مارس",
        "أبريل",
        "مايو",
        "يونيو",
        "يوليو",
        "أغسطس",
        "سبتمبر",
        "أكتوبر",
        "نوفمبر",
        "ديسمبر",
    ];

    static islamicMonths = [
      "محرم",
      "صفر",
      "ربيع الأول",
      "رَبيع الثاني",
      "جمادى الأولى",
      "جمادى الآخرة",
      "رجب",
      "شعبان",
      "رمضان",
      "شوال",
      "ذو القعدة",
      "ذو الحجة",
  ];
      static numberMap: { [key: number]: string } = {
        1: "واحد",
        2: "اثنان",
        3: "ثلاثة",
        4: "أربعة",
        5: "خمسة",
        6: "ستة",
        7: "سبعة",
        8: "ثمانية",
        9: "تسعة",
        10: "عشرة",
        11: "أحد عشر",
        12: "اثنا عشر",
      };
      static school = new Map<number,any>([
        [0, 'شافعي'],
        [1, 'حنفي'],
      ])
      static methods = new Map<number,any>([
        [0, 'جعفري / شيعة اثنا عشرية'],
        [1, 'جامعة العلوم الإسلامية، كراتشي'],
        [2, 'الجمعية الإسلامية لأمريكا الشمالية'],
        [3, 'رابطة العالم الإسلامي'],
        [4, 'جامعة أم القرى، مكة المكرمة'],
        [5, 'الهيئة العامة للمساحة في مصر'],
        [7, 'معهد الجيوفيزياء، جامعة طهران'],
        [8, 'منطقة الخليج'],
        [9, 'الكويت'],
        [10, 'قطر'],
        [12, ['مجلس الأئمة في سنغافورة', 'الاتحاد الإسلامي الفرنسي']],
        [13, 'رئاسة الشؤون الدينية، تركيا'],
        [14, 'الإدارة الروحية للمسلمين في روسيا'],
        [15, 'لجنة رؤية الهلال العالمية (تحتاج أيضًا إلى معلمة الشفق)'],
        [16, 'دبي (تجريبي)'],
        [17, 'جبهة تطوير الإسلام في ماليزيا (جAKIM)'],
        [18, 'تونس'],
        [19, 'الجزائر'],
        [20, 'وزارة الشؤون الدينية في جمهورية إندونيسيا'],
        [21, 'المغرب'],
        [22, 'الجماعة الإسلامية في لشبونة'],
        [23, 'وزارة الأوقاف والشؤون الإسلامية والأماكن المقدسة، الأردن']
      ]);
      
      
      
}