import { Metadata } from "next";
import Link from "next/link";

export const metadata: Metadata = {
      
    title: "إخلاء المسؤولية",
    description: "إخلاء المسؤولية"  };

export default function Disclaimer() {


    return (
        <div className="bg-white p-6 rounded-xl shadow-md">

            <h1>  إخلاء المسؤولية </h1>
            <p>آخر تحديث: 18 سبتمبر 2024</p>
            <h2>التفسير والتعريفات</h2>
            <h3>التفسير</h3>
            <p>الكلمات التي يبدأ أول حرف منها بحرف كبير لها معاني محددة وفقًا للشروط التالية. التعريفات التالية ستحمل نفس المعنى بغض النظر عن ظهورها بصيغة المفرد أو الجمع.</p>
            <h3>التعريفات</h3>
            <p>لأغراض هذا الإخلاء:</p>
            <ul>
                <li><strong>الشركة</strong> (يشار إليها إما بـ &quot;الشركة&quot; أو &quot;نحن&quot; أو &quot;لنا&quot; في هذا الإخلاء) تشير إلى أوقات الصلاة في مدينة الرياض.</li>
                <li><strong>الخدمة</strong> تشير إلى الموقع الإلكتروني.</li>
                <li><strong>أنت</strong> تعني الفرد الذي يصل إلى الخدمة، أو الشركة، أو أي كيان قانوني آخر نيابة عن هذا الفرد الذي يصل إلى أو يستخدم الخدمة، حسب الحالة.</li>
                <li><strong>الموقع الإلكتروني</strong> 
                يشير إلى   <Link href="/">أوقات الصلاة في الرياض </Link> ، المتاح عبر  prayertimesriyadh.com.</li>
            </ul>
            <h2>إخلاء المسؤولية</h2>
            <p>المعلومات الواردة في الخدمة مخصصة لأغراض المعلومات العامة فقط.</p>
            <p>لا تتحمل الشركة أي مسؤولية عن الأخطاء أو الحذف في محتويات الخدمة.</p>
            <p>لا تتحمل الشركة تحت أي ظرف من الظروف أي مسؤولية عن أي أضرار خاصة أو مباشرة أو غير مباشرة أو تبعية أو عرضية أو أي أضرار من أي نوع كانت، سواء كانت ناتجة عن عقد أو إهمال أو غير ذلك، والتي تنشأ عن أو تتعلق باستخدام الخدمة أو محتوياتها. تحتفظ الشركة بالحق في إجراء إضافات أو حذف أو تعديلات على محتويات الخدمة في أي وقت دون إشعار مسبق. تم إنشاء هذا الإخلاء بمساعدة مولد إخلاء المسؤولية.</p>
            <p>لا تضمن الشركة أن الخدمة خالية من الفيروسات أو المكونات الضارة الأخرى.</p>
            <h2>إخلاء المسؤولية بشأن الروابط الخارجية</h2>
            <p>قد تحتوي الخدمة على روابط لمواقع إلكترونية خارجية لا تديرها أو تحافظ عليها الشركة بأي شكل من الأشكال.</p>
            <p>يرجى ملاحظة أن الشركة لا تضمن دقة أو ملاءمة أو توقيت أو اكتمال أي معلومات على هذه المواقع الإلكترونية الخارجية.</p>
            <h2>إخلاء المسؤولية عن الأخطاء والإغفالات</h2>
            <p>المعلومات المقدمة من قبل الخدمة مخصصة للإرشاد العام فقط في الأمور ذات الاهتمام. حتى لو كانت الشركة تتخذ كل الاحتياطات لضمان أن محتوى الخدمة محدث ودقيق، قد تحدث أخطاء. بالإضافة إلى ذلك، نظرًا لتغير القوانين والأنظمة، قد تكون هناك تأخيرات أو حذف أو أخطاء في المعلومات الواردة في الخدمة.</p>
            <p>الشركة ليست مسؤولة عن أي أخطاء أو إغفالات، أو عن النتائج المترتبة على استخدام هذه المعلومات.</p>
            <h2>إخلاء المسؤولية عن الاستخدام العادل</h2>
            <p>قد تستخدم الشركة مواد محمية بحقوق الطبع والنشر لم يتم تفويضها دائمًا من قبل صاحب حقوق الطبع والنشر. تتيح الشركة مثل هذه المواد للنقد أو التعليق أو التقارير الإخبارية أو التدريس أو المنح الدراسية أو البحث.</p>
            <p>تعتقد الشركة أن هذا يشكل استخدامًا عادلًا لأي مادة محمية بموجب حقوق الطبع والنشر كما هو منصوص عليه في المادة 107 من قانون حقوق الطبع والنشر بالولايات المتحدة.</p>
            <p>إذا كنت ترغب في استخدام مواد محمية بحقوق الطبع والنشر من الخدمة لأغراضك الخاصة التي تتجاوز الاستخدام العادل، فيجب عليك الحصول على إذن من صاحب حقوق الطبع والنشر.</p>
            <h2>إخلاء المسؤولية عن الآراء المعبر عنها</h2>
            <p>قد تحتوي الخدمة على آراء ووجهات نظر تعبر عن أصحابها ولا تعكس بالضرورة السياسة الرسمية أو موقف أي كاتب آخر أو وكالة أو منظمة أو شركة أو حتى الشركة.</p>
            <p>التعليقات المنشورة من قبل المستخدمين هي مسؤوليتهم الشخصية، وسيكون المستخدمون مسؤولين عن أي قذف أو دعوى تنجم عن شيء مكتوب في التعليقات. الشركة غير مسؤولة عن أي تعليق منشور من قبل المستخدمين وتحتفظ بالحق في حذف أي تعليق لأي سبب من الأسباب.</p>
            <h2>إخلاء المسؤولية عن المسؤولية</h2>
            <p>المعلومات المقدمة على الخدمة تم تقديمها مع فهم أن الشركة لا تقدم هنا استشارات قانونية أو محاسبية أو ضريبية أو أي نصائح مهنية أخرى. وبالتالي، لا ينبغي استخدامها كبديل للتشاور مع مستشارين محترفين.</p>
            <p>في أي حال من الأحوال، لن تكون الشركة أو مورديها مسؤولين عن أي أضرار خاصة أو عرضية أو غير مباشرة أو تبعية تنشأ عن أو تتعلق بوصولك أو استخدامك أو عدم قدرتك على الوصول أو استخدام الخدمة.</p>
            <h2>إخلاء المسؤولية الاستخدام على مسؤوليتك</h2>
            <p>جميع المعلومات في الخدمة مقدمة كما هي بدون أي ضمانات من أي نوع، سواء كانت صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر الضمانات المتعلقة بالأداء أو القابلية للتسويق أو الملاءمة لغرض معين.</p>
            <p>لن تكون الشركة مسؤولة تجاهك أو تجاه أي شخص آخر عن أي قرار أو إجراء يتم اتخاذه بالاعتماد على المعلومات المقدمة في الخدمة أو عن أي أضرار تبعية أو خاصة أو مماثلة، حتى إذا تم إبلاغك بإمكانية حدوث مثل هذه الأضرار.</p>
            <h2>اتصل بنا</h2>
            <p>إذا كان لديك أي أسئلة حول هذا الإخلاء، يمكنك الاتصال بنا:</p>
            <ul>
                <li>عن طريق البريد الإلكتروني: support@prayertimesriyadh.com</li>
            </ul>
        </div>
    );
}